#include<stdio.h>
#include<windows.h>
int main()
{
	////一：
	//char a = -1;
	//signed char b = -1;//发生整形提升(只跟自身类型相关)，即：有符号数高位补符号位、无符号数高位补0.
	//unsigned char c = -1;//-1先以二进制补码的形式存放在内存当中，当以%d的形式打印的时候，-1的二进制序列会被送到cpu的寄存器当中，
	//printf("a=%d,b=%d,c=%d\n", a, b, c);//而在32位cpu当中寄存器占32各bit位，将8bit的二进制数放入32bit的寄存器当中会发生整形提升。整形提升之后的二级制序列：
	//									//  a补符号位即1   ： 1111 1111 1111 1111 1111 1111 1111 1111  真值为 -1.
	////二：
	//char d = -128;
	//printf("%u\n", d);//111 1111 1111 1111 1111 1111 1000 0000
	////三：
	//char e = 128;
	//printf("%u\n", e);
	////四：
	//int i = -20;//            1111 1111 1111 1111 1111 1111 1110 1100
	//unsigned int j = 10;//    0000 0000 0000 0000 0000 0000 0000 1010
	//printf("%d\n", i + j);//  1111 1111 1111 1111 1111 1111 1111 0110  真值：-10
	//五：
	//for (unsigned int k = 9; k >= 0; k--)
	//{
	//	printf("%u\n", k);//  1111 
	//	Sleep(1000);
	//}			
	//六：
	//char a[1000];
	//int i;
	//for (i = 0; i<1000; i++)
	//{
	//	a[i] = -1 - i;//a[0]=-1-0;a[1]=-1-1;a[127]=-1-127=-128;a[128]=-1-128=127;a[255]=0;
	//}					//												1111 1111
	//printf("%d", strlen(a));    //                           //		1000 0000
																//	   10111 1111
	//七：

	system("pause");					
	return 0;
}